{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DSWiwtUyWK1YwY8NBKDhGg", "review_id": "mVLrJQl_A8N-_42z1v-TBw", "text": "This is by far my favorite Panera location in the Pittsburgh area. Friendly, plenty of room to sit, and good quality food & coffee. Panera is a great place to hang out and read the news - they even have free WiFi! Try their toasted sandwiches, especially the chicken bacon dijon.", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 5, "date": "2009-02-08", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "7DeM4C66zVflYNrZn_Vv9g", "review_id": "Dt__kHHHuN2IiTUxezIuUA", "text": "I live close by so I go here frequently pretty much for the free WIFI and espresso. But here's a secret - they don't seem to know what an Americano is so often I am charged like 75 cents for a double shot of espresso to which they add hot water upon my request. Needless to say coffee is not expensive here as you can fill up as many times as needed without being hassled. Although there regular coffee is undrinkable to my taste. Pastries are baked fresh and are plentiful. There is other foods to choose from ie whole grain bagels are edible and about a buck with no extra charge for butta. Outside seating and people watching is always a good distraction plus there are all kinds of people who frequent this Panera from the very very old and decrepit to the fashionistas taking a break from Victoria Secrets, Ulta, Wet Seal and the other various shops at this water front location.", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 4, "date": "2009-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "yfRrC6MhxpIJ4-xMcrmk5Q", "review_id": "12Aa1Yx5AZL02YP3-Wh5dw", "text": "Had lunch here after getting my nails done in the Waterfront.  It's your standard Panera - lots of seating and a sunny room from all the windows.  Our food was made very quickly, even though the place was pretty busy (lunch on a Saturday).  Chicken noodle soup is tasty, but there was too much broth and not enough noodles and chicken.  I tried their Sierra Chicken sandwich for the first time, and it was pretty good.  It's very flavorful, I like whatever they put in their chipotle mayo.  It was a salty meal though - definitely had me running to the fountain machine to get more water.\n\nIf I have to get a quick, light meal and only chain options are available, Panera is my best choice.  It's definitely predictable and usually tasty.  But there isn't much special about it, of course.", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 3, "date": "2011-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Enzdhh-rV5JgC4lgg0IdFw", "review_id": "mCX2xGwSNHUF-NAJHr1zQA", "text": "I Love all Panera, equally!\nI am def a fan of this easy, better than fast food, time-killing eatery.\n\nGreat place for a lunch social/date with good eats and a good place to sit and talk for a while or to get some work done between appointments.\n\nPROS:\nGreat Food;\nFree WiFi (though some locations are limited to 30 minutes during the lunch hour);\nSeating is always tricky at the lunch hour.\n\nCONS:\npricey for salads, soup and sandwiches;\ntables should be wiped more frequently--even if you have to ask a newly seated guest if they would like it wiped, the tables should be wiped!\n\nFor Pete's sake, give a fork with the Mac and Cheese, not a SPOON!  lol", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 4, "date": "2011-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q3fFv_ft17OyV-NRF1iQxw", "review_id": "bT5c7YxqaoGrDuEkNiHNkg", "text": "I really enjoy Panera, and this restaurant meets my expectations. I particularly love the Asiago Cheese Bagel, Caesar Salad, Bacon Turkey Bravo Sandwich, Tuna Salad Sandwich, Smokehouse Turkey Panini, Broccoli Cheddar Soup, and Iced Chai Tea Latte. I've ordered all of these items at this location, and they have been very tasty.\n\nI have had this location run out of the side of French Baguette once or twice. However, last time that occurred, I asked for a bread bowl as a replacement, which I was given for free.\n\nI'll definitely be returning soon!", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 4, "date": "2012-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wtQsINapBJLhtfIe2xecpw", "review_id": "PiGOcL8SoTbF2TNYdrzV8w", "text": "I've had bad experiences here a few times now.  I wrote panera bread and haven't heard back.  Bad service all around!!!  Basically, we ordered our food, they ran out of what we wanted, so just decided to make us something else with out telling us.  When we got our food, we asked why they made us that instead of what we ordered---'oh it was the closest to what you wanted'.....hmmmm how about you tell us that before we pay, and how about you give us our money back.  Really, you don't get much for what you pay for at panera.  Its not very good at all.", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 2, "date": "2012-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WMTm9HHRA3EewoxTX1Gleg", "review_id": "H1jJp4RXc03y_RtEsWw2vw", "text": "It's the same Panera food you've had before.  I like the other ones better as they are often  faster at preparing food than this one.  That said the food is fine and the staff is nice enough.\n\nThey have warm cookies for $2.00.  That is a nice feature.", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 4, "date": "2012-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "UnGPr6ZnGe9YOSZRopnS5g", "review_id": "1H5RL-iXf0SeqX42VO5H2w", "text": "It seems silly to rate a chain so I won't talk about the food. \n\nI just love coming to this Panera because it's right by Barnes and Noble.  I recently started getting into the Panera card. Compared to the other Paneras I have to say that this one seems cleaner, bigger, and all around nicer.  Of course I would never go out of my way to get here but if you're at Barnes and Noble and aren't happy with the sandwiches there (which I was) I would venture on over to Panera.", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 3, "date": "2013-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oK2kLPlQjso4RrX98Cb1UA", "review_id": "dZFjteDrVqDuGgJPj2X0fQ", "text": "Service here is pretty bad. They were out of napkins and cup lids. I ordered chicken tortellini pasta and chicken noodle soup. My chicken seemed undercooked in the pasta and there wasn't any chicken in my soup.", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 2, "date": "2014-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nyDUmYdLrdHNWCopqJmZ5A", "review_id": "KMv8N5Bix9zyCwFiUxZW2g", "text": "Amazing amazing place and I really enjoy to eat there and drink the prices they not high, very good service and fast .", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 5, "date": "2014-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "I2zYqls8VMzjdzBAEPR0Iw", "review_id": "bire2mjcDyzZmkrK4IZgoQ", "text": "Panera bread has to be the most inconsistent restaurant I have ever been to. I have posted two pictures of the strawberry poppyseed chicken salad. The first one looks delicious the second one looks like they could've used a smaller bowl. It did not even look appetizing.", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 2, "date": "2014-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "UD7Y1CqfY6mDmRwIuCf6nA", "review_id": "feDKgj_o3yf7zXZhFIbBJg", "text": "This use to be my go to Panera Bread.  When I worked in the area I would stop here before work to grab my breakfast and then stop to get my lunch as well.  I was happy when I left the area and moved on to bigger and better things.  My waist also appreciated it.  Those scones are delicious.\n\nI recently stopped back here when I was shopping and was pleasantly surprised.  With all my new allergies I came in here hoping to get some bread.  Not knowing, nor doing my homework before I showed up, I asked the manager if one particular bread had corn syrup in it or not.  Not knowing the answer herself, she was kind enough to pull out a binder that contained all of their recipes, ingredients included.  After looking through it for a few minutes I was able to select the bread I wanted.  They will sliced the bread thick or thin for you there right now.  If you would rather slice yourself, I am sure they will wrap it up and you can go on your way.  Yes, it's true, it may be a bit more expensive than your cheap bread on the grocery store shelf.  But it is much better tasting.", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 4, "date": "2014-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J4vFm5IlUKbTSN7Jekk8cw", "review_id": "TzVQ80Ay2V2jmFeThnubWQ", "text": "In general, I like Panera so rather than reviewing Panerai overall, I'm going to compare this Panera store to other Panera stores that I've been to.\n\nI've been here a couple times and so far, no major complaints in terms of food and service. The people are generally friendly (honestly, they are probably the friendliest Panera staff I've seen in all of the Panera stores I've been to in Pittsburgh, although I haven't been to them all). Once, I came in after breakfast time and asked for a quiche and they gave it to me without any problems. I haven't had to wait super long, even if there are a lot of people. \n\nHowever, my biggest problem with this Panera store is that there are hardly any outlets and seating is rather a pain. I like to go to Panera to eat and do work at the same time but it's rather hard when there aren't many seats and very few outlets.\n\nFood: 4 stars - just your average Panera food\nService: 5 stars - as mentioned, pretty good experience\nSeating: 1 star - don't come here to work or come with a huge party\nOverall: 3 stars", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 3, "date": "2015-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nqZNNKrc8CdokfFbOKKSdQ", "review_id": "a0Lo5iXHaE0jQUpgiPTnIQ", "text": "Non existent internet service.   I came here to do some work on my laptop and the internet speed wasn't strong enough.  :(", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 1, "date": "2015-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KSS6v5fcZNoelu4eEZCFcw", "review_id": "EYzgB4Ok77qw5QMmIaPnlw", "text": "Sometimes I use Panera as a lunch place and sometimes I use it as an office. Either way I tend to spend a lot of time at Panera. If I am meeting someone I prefer to sit in a booth for more privacy. I like the homey feel of Panera and love it when I get to sit by the fireplace. \nThe bakery items are always fresh. It's nice that they keep the chocolate chip cookies warm. Yum!\nThe food is unpredictable. Sometimes it's good and sometimes it's not so good. The serving sizes on their soups and salads have shrunk considerably in the last year. They do have a good selection of food. They keep adding healthier options. Their recent addition is Soba Noodle Bowls. They look good but I sense a lot of sodium hides in them. \nIf you need a place to meet someone to chat or get some work done it is a good place. Food wise there are many other choices to consider around the city for better food at the same prices.", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 3, "date": "2015-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v2RizcWnJ-h06ohPKD_JMQ", "review_id": "KLLhoqWYKmJcqMWuRnCGjg", "text": "Panera is one of our family's favorite restaurants. Everything is great. Kids love bagels and chicken noodle soup. Adults usually order \"you pick two\". Sandwiches, salad are all very good.", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 5, "date": "2015-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "s0qiS71nzMUmqBdM4oPc7Q", "review_id": "sC6zvWd6AGOpU3y3883KmA", "text": "This Panera Bread location is ideally located in the Waterfront shopping center in the midst of several shops and a large parking lot. The space itself is much larger than many other locations I have been to and has ample seating, which is always a good thing. Unfortunately, the service is slow and unfriendly (there was no line and it took a few moments for someone to notice there were customers trying to order). I was surprised that I was automatically given a baguette with my meal rather than being offered a choice between the bread, an apple or a bag of chips. Perhaps it is this location, or maybe it was just a one-off oversight. As I mentioned, there is plenty of seating, but our options were limited because all of the tables were disgusting with trash on them and in desperate need of a wipe-down. If it were over lunch or a rush, I would be more sympathetic, but there were only a handful of patrons in the entire establishment. I was also upset that the WiFi was not functioning. Despite my nitpicking, the food was fine and it is a standard Panera, just not a stellar location.", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 3, "date": "2015-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "9HCfCmd0t5GErgm7He6AeQ", "review_id": "56v84iiPmP3nYHZPpCWQ9Q", "text": "It has been several months since I visited Panera Bread. It is a bakery cafe chain with free WiFi. Prices are reality the same although from time to time they change their seasonal offerings.\n\nFood is fair. You order and you are given a buzzer to let you know when your food is ready. They use real dishes and silverware. The menu gives you a calorie count of each item you are purchasing.  One of the popular feature items is you pick two where you can have half a sandwich or salad or soup in a pair of two of those items. You also get with it a choice of an apple or roll and you can add a dessert for $1.00\n\nI was disappointed to learn they had removed the French onion soup from the menu. I asked about this removal only to learn there was something wrong with one of the ingredients. The other disappointment was that this year they are not making gingerbread men which are one of my favorite holiday treats. Instead they are offering a holiday themed sugar cookie.\n\nI normally eat here when I'm in a hurry and don't have time to sit down at a regular restaurant. They do use fresh breads and they do cater. You can also order your holiday baked goods or breads for your parties.", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 3, "date": "2015-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tTuPaw_uV6pIvWXA8q5Exg", "review_id": "MMDFnaNQ0SbgNIs_bIl-cA", "text": "Stopped by Sunday morning. The light roast coffee was cold. I ordered a Steak & Egg breakfast sandwich. The Steak was ice cold. The slice of tomato that I had them add was not ripe. Panera quality should be consistent no matter what location you visit. Very disappointing considering their pricing structure.", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 1, "date": "2015-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b-cxzMSlVDglonS0zd26Dg", "review_id": "Q_99JGAaWbBX61R9eQie6Q", "text": "DO NOT EAT THE PASTRIES! We saw the manager do a nightly count of all the pastries and touched everyone with his fingers (no gloves). I commented and said excuse me you are touching all of the pastries with no gloves??! He looked at me and said, \"I'm not touching them I'm only tapping them\". Yuk, i said that's disgusting people have to eat that. He looked at me and went in the back. I told the cashier Thomasina that i would be calling the owner.. that's unexceptable. She reluctantly gave me the owners name. Luke I'll be calling U tmrw!", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 1, "date": "2016-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J4_h3xmkDlYSro1qpdweKw", "review_id": "OHkyygU2pipwwNfVhkcyWA", "text": "The quality....and everything varies here.\nCan't guarantee clean floors. Sandwiches are different every time I get one. \nService is mostly positive.\nAlso, there's a big hump in the floor - see if you can find it!", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 3, "date": "2016-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K7e83s1uzB3gh8j2fvc3Vw", "review_id": "hxqfGQPecwOs_CY-s0f-_A", "text": "Service here has gone considerably downhill. Orders messed up, longtime staples on their menus dropped, and prices jacked up. Needless to say, will be my last time going there.", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 1, "date": "2016-05-20", "type": "review"}
