{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "q_u-rcJTi2nQzeWQ92rJtg", "review_id": "i1CT1TfopKzakyWsvxrzig", "text": "When I lived in Los Angeles a year and a half ago, P F Chang's was no great shakes, one of millions of places with good but not outstanding stuff on the menu.\n\nHere in Pittsburgh, it's the only Chinese place I've found that combines genuinely good service with quality food.  Not, perhaps, as good as what you can get in LA's top places, but fantastic compared to its competition here.\n\nThe Kung Pao chicken is particularly good, with delicious fried chicken cubes and the usual hot sauce and chiles.  Chicken with lettuce wraps is good too.\n\nTheir fried noodle dish with chicken, whose name I have forgotten, is addictive but has an odd sauce I don't quite like.  Still, they get the friedness of the noodles right, and there are precious few ... ahem ... no other restaurants around here that do.\n\nPortions are small, so either plan to get an appetizer and an entree or expect to leave almost as hungry as you came.  The minced chicken in lettuce wraps appetizer is outstanding and you get about the same amount of food as in one of their entrees.\n\nIf you live in LA, forget P F Chang's.  If you live in NYC, I'm sure there are a dozen better places on a single block.  But here in Pittsburgh, it's just about the best place around.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2005-12-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "lpsFN1DQYBB1YkzKUUlf2w", "review_id": "QiuyWeFm3VujpW9NFFjP3w", "text": "I hate this place.\nIt's very loud, the service is very poor, and the food is so-so.\nIf you want good Chinese in Pittsburgh, try China Palace (Shadyside) or Sesame Inn (Station Square or North Hills).  They're quieter, with very good food & service.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2008-11-22", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "iykSymLl4s0M1oKE_BY6tw", "review_id": "mCZQEYD29BVJ5Oz-wcIthw", "text": "Any place that accommodates with a special dietary menu for a little known disease gets five stars from me.  P.F. Chang's has a dedicated Gluten-Free Menu for those of us who suffer from celiac disease.  They also make sure to clean down the area they prepare the specialty dinner so as to avoid cross-contamination.  I don't know many other restaurants that go this far.\n\nAside from the menu preference, I enjoy my overall experience every time.  Their menu is a bit different than that of what most people will be used to if you regularly eat a Chinese Take-Out or Buffet joints.  Don't expect this to be at all like that.  It's not a Buffet.  They don't sell \"General Tso's\" (though Chang's Spicy Chicken is recommended for those looking for something similar, it's my personal favorite) or other signature foods that you may expect.  They do sell very similar items with different names and a few of their own adjustments, just make sure to read the menu description and ask questions if you are not sure.  They also sell Sake, I believe they have a few different types.  \n\nThe prices can get a bit more expensive than your average Chinese Restaurant depending on what you get but it's well worth it.  Portions are excellent and the taste is great.  I've yet to have one complaint and I have frequented this establishment several times over the span of a few years.\n\nThe only downside, it can be a little crowded and a bit loud.  It's also very dark because of their lighting.  However, I think it sets the atmosphere.  It can be a romantic place or a casual place, I've been there for both.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 5, "date": "2009-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "x_MbMxRc_FVlZrTqclfUyw", "review_id": "5rb4Ec_H9WhwINWKUIfeSA", "text": "Wasn't terrible,\nBut certainly wasn't great.\nSave your hard-earned cash.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2009-10-09", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 2}, "user_id": "T_wjLgPOPXry7Bea4MzoVQ", "review_id": "oYANxEF4XEvP_1BnkGjFcQ", "text": "REDO!\n\nI went to PF Chang's several years ago and was NOT pleased with the food that was presented to me.  \n\nMy issue: I thought I was getting Chinese food.  \n\nMy resolution: Try this restaurant again knowing that it is just reinvented American food with names of those Chinese dishes I actually like to eat.\n\nSo we returned to PF Chang's for lunch to try this American food in this caricature of a Chinese restaurant.  There were very few people in the restaurant.  The two of us were seated in the largest corner booth and left to review our menus.  When our waitress finally arrived we ordered the following items:\n\nCoca Cola\nIced Tea\nPan fried pork dumplings\nSesame chicken lunch with white rice and egg drop soup\nChangs chicken with white rice\n\nOur drinks and my soup came out immediately.  Unfortunately I was brought the wrong soup and the server had disappeared before I had a chance to say anything.  I could see her across the barren wasteland that was the dining room and we even made eye contact several times, but at no point could I get her to come back to my table.  I tried the soup and was disgusted with it and placed it at the end of the table.  I didn't know what it was and didn't want to know.  Almost ten minutes later she arrived quite happy with the job she was doing and asked how the food was.  I asked if she could bring out some egg drop soup. I didn't expect to get the stink-eye.\n\nMy egg drop soup was brought out with the dumplings as well as the caddy of different sauces and oils.  The server really wasn't that into the experience, but again gave me the stink-eye when I told her that mixing the sauces was unnecessary since I knew what each of them was and would be able to mix them myself.  I mixed the rice vinegar, chili oil, chili paste, and soy sauce (my guess is that it was supposed to be tamari) to create a dipping sauce for our dumplings. I took a bite of the soup and it was somewhat better than the other soup, but it was still brown.  I ate half the bowl and left the rest for the server.  It was thick and gooey and the flavor didn't wow.  I saw no reason to continue.  I moved on to the dumplings, which had an okay flavor to them.  The skins were a bit thick and doughy.  The meat on the inside did not balance this attribute at all.  The sauce tasted a little odd so I tried to remix and it was still off.  I tried the components individually and found that some of them were either old, stale, or rancid.  We finished our dumplings.\n\nOur lunch entrees arrived.  I had ordered mine extra-spicy, but I guess it came Pittsburgh Hot (super mild) and had a lackluster flavor at best.  The meat was tough and the sauce tasted of soy sauce more than anything else.  I tried some of Chang's chicken and was equally mollified.  This was supposed to be their version of General Tso's Chicken.  Now I have never had a General's chicken that was the same at any place.  It is always different.  Many of them are good in different ways.  This food, though, it wasn't good.  Chang's chicken fell into the same category as the Sesame Chicken -- since it tasted mainly of soy sauce -- with the addition sugar.  \n\nI just don't understand how anyone can like this place.  Even the Yoshida Sauce you get at Sam's/Costco tastes better.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 2, "date": "2009-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "oahclh0MZzSuTpRZSH-6Ug", "review_id": "gDF0jHgRPa5dq1yFKo62pg", "text": "Honestly, I'm furious. I enjoyed PF Chang's restaurants in the Chicago area, and my wife and I have eaten a few times at this Pittsburgh-area location. Over the last year, we have tried repeatedly, but the 90-120 minute wait for dinner is unacceptable. We tried going early, late -- it never made any difference. The front staff was rude, and the wait was too long.\n\nTonight, we had a special date planned, and made reservations a week in advance. We came in the door exactly on time, waited in the line to see the front staff, and we were promptly handed a pager. They couldn't tell us when we would be seated.\n\nI imagined a short wait, so we went outside, crossed into a store to wait (since the entrance of this location is so packed, it's impossible to wait at the bar or in the meager seating).\n\nAfter 20 minutes we gave up. We went back to PF Chang's and the front office staff still couldn't tell us when we would be seated. I saw open tables.\n\nWhat on earth is the point of accepting reservations if you do not honor them?\n\nThe food here is good, but certainly not great. We went to a local Thai place and were seated with no problem in 5 minutes. The food was much better, the service was good even in a crowded busy restaurant. Oh, and the local place was a much more reasonable price.\n\nWe certainly will never visit PF Chang's again.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2010-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EjxE1dW0WVqOezpKqFN5kQ", "review_id": "WShRTTVDHvlt1xCGYpDuxg", "text": "Stars are for the food only.    2.5 rating\n\nGot there at 8pm on Saturday night, they told us it was an hour wait which was expected, but it only took 30minutes to be seated so that was a bonus.  Started off with the lettuce wraps and i used to be a fan of these but they just seem to bore me now(FYI-love the lettuce wraps at the cheesecake factory).  I had the Singapore rice noodles.  This was so so as i thought immediately that lu lu noodles and asian cafe are better.  The fried rice was disappointing and the vegetables tasted raw.   Some good notes were the Dynamite shrimp, plump, juicy, tangy with a small kick.    Sweet and sour chicken was just the same minus the kick. \n\nThe service was annoying.   We were there less than 45 minutes and it seemed like our waiter was in a rush to get us out of there.   Constantly asking if he could remove my plate.  I had to sternly say at one point that I will let you know when i am finished.  I found it rude especially since  there wasn't even a line at this point.  \n\nI think we will travel elsewhere following a movie.  The result never quite met the anticipation.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 2, "date": "2010-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tPUGLlDZLF7HrOC46NqTOA", "review_id": "pxoJdoYcKQ18FM7ffWzUAg", "text": "I like PF Changs.\n\nI think I've only been here a total of three times (twice it was take out), and I only get vegetarian dishes, but what I've had has been pretty tasty.\n\nI would definitely eat here again.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2010-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "jaDTgMqh4DzoLJrMrW3JcA", "review_id": "XHjdZyJ8yfJDRwOX-SOkMg", "text": "I am writing this from the standpoint of someone who can't eat real Chinese food because of gluten issues. That said, I am loving me some gluten-free Chinese food here! If the gf issue didn't exist, though, why bother when you can get real, honest, non-chain GREAT Chinese so many wonderful places in the Burgh?!  But average Chinese is better than NO Chinese if gluten is an issue so thank you Mr. Chang!", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2010-06-27", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "Enzdhh-rV5JgC4lgg0IdFw", "review_id": "NLVOP1-ysVZp1bexe_jn1Q", "text": "Pretty Good Stuff!\n\nPROS:\nNice bar area\nCool ambiance\nnice dishes with good flavors\n\nCONS:\nPricey for \"just chinese food\"\ntypically a rather long wait, especially on weekends.\nVery difficult to even get noticed by the bartenders once its busy at the bar area.\n\nSuggestions:\nLettuce Wraps (just get this as you meal!  LOL)\nFat Cat Martini (OMG, YUMMMMM!)\nPot Stickers", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2010-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_vS9qNQvx8wVUOIkj4qfAg", "review_id": "tIh4bIPeMjWyE5a0X2Vysw", "text": "Our go to place at the waterfront. \n\nWe usually order the crispy green beans as an app., they are always fried just right and never really greasy. As an entree I always get coconut curry tofu, the veggies are bright and crisp (no open pea pods or limp broccoli!) And the tofu is simply delightful. \n\nAlways consistent. Never disappointing", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2010-12-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5oh0lwYkRPhV3mGjyZQWJw", "review_id": "ioU2uI5ZJHOP64n4bd2hig", "text": "Went there for lunch and had a decent meal.  While the Mongolian Beef was beyond excellent, the Moo Goo Gai Pan was average (although I did enjoy the shrimp in it).  Service was fine and decor is pleasant.  For some reason I'm just not in the mood to write a detailed review - please accept my apologies.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2011-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "7PDm_RG8tTTKrauImGbPuQ", "review_id": "DhQjFOBGcVA9EgzvGiJrMw", "text": "Sadly I've been here a few times because it's a crowd pleaser when my girlfriend's parents come down to visit. There's nothing really WRONG with it. The portions are big and the food is \"alright\" and the interior gives you the superficial impression that you're encountering fine dining.\n\nThe food is sooooo bland though. Everything you get at P.F. Chang's you can get elsewhere in Pittsburgh at a much lower cost and it'll be made with more precision and have better flavor. The honey chicken at P.F. Chang's was so mediocre all I could think about while eating it was heading over to Wai Wai in Bloomfield and getting a tastier order of it for 8 bucks.\n\nLast time we were there the server was horrendous as well. I don't think I've ever felt as awkward at a restaurant. He brought my girlfriend's father (Don) his unsweetened tea then told him he didn't bring sugar because he asked for it sweetened and then did not understand the concept of sweetening it yourself. He then got all huffy when Don kept asking for it and actually seemed angry at us. When he came back to take our order Don ordered for himself and his wife and before Janey (my girlfriend) and I could order he had already started to walk away. We actually had to yell out to get him to come back and finish our order. (not in an uncivilized or malicious way, either) After that he must have thought we were terrible diners (I don't think I've ever been impolite to someone who is currently at work, or ANYONE for that matter) and he showed it by being silent and plopping things down in a passive aggressive way. It was really embarrassing and every time he came by the conversation died.\n\nObviously the attitude of one idiot who can't hide his bad day well doesn't really have anything to do with the restaurant. But it's soooooo bland! Go somewhere else for Chinese! Look up Chinese on Urbanspoon and it'll give you a variety of good, local places to choose from at half the price.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 2, "date": "2011-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bvu13GyOUwhEjPum2xjiqQ", "review_id": "T6IRygTdMMYsuUvI-fq9Qw", "text": "My vegan friend, Deb, turned me onto the fact that one can dine at PF Chang's and stay on a vegan diet.\n\nVegan friend Deb (VFD) asked the waitress if they could prepare a version of the famous chicken and lettuce wraps. The waitress without hesitation proclaimed they always had a vegan version, but it was never put on the menu.\nWarning: even though it's vegan, it still contains the same amount of salt that was reported on all the news channels when the salt, fat, and cholesterol police made the sodium content available to the public. The vegan version is just as delicious and the chicken.\n\nThey also have vegan dishes like string beans and garlic, eggplant and garlic, and a few dishes with tofu and vegetables.\n\nI always loved the fact PF Chang's offered brown rice. That nutty flavor goes so well with their meals.\n\nThe service staff at Chang's is always top shelf, I've never had a bad time here and love when we go.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2011-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IyT6y6YIvvvZvj2X6Pb4iQ", "review_id": "uddb87kSErepF0GWar7xTw", "text": "We visitied PF Changs on Sunday with a large group of 20 people.  Although they had to split the tables - everything was delicious!\n\nWe enjoyed everything from the spring rolls and chicken lettuce wraps...to the mooshu that they made special vegetarian for one of the guests...to the fried banana dessert!\n\nif you are with a group, and you want dessert - get the fried bananas!  They come wrapped in a spring roll wrapper and with coconut/pineapple ice cream.\n\nOverall, we had a great time and would come back here again.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2011-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "3d0Vw3hPiUEWMwrlnC-IOQ", "review_id": "JnmyicYvyus-lG3ErL_Rfg", "text": "I've had PF Changs both in Pgh and KC and honestly, I'm never been disappointed nor elated with the food. It's 'upscale' Ameri-Chinese food. You don't come here seeking 'authentic' Asian staples; it's all changed to some degree to suit American taste buds... nothing wrong with that, imo. Do I even know what 'authentic' Chinese food is? Yes, sortuv, somewhat. Will I stop putting quotes around 'everything'? Definitely not!\n\nIt was 45 min from closing time when we (party of 6) rushed in on a weeknight; got seated, ordered and ate without feeling rushed by the staff.\n\nThis particular PF Changs, on the Homestead Waterfront, had fast and friendly service, though he forgot our order of asparagus. We sampled everything from the the Szechuan shrimp to the Mongolian beef to the Dan Dan Noodles. Good flavors, nothing that stepped out in the crowd.\n\nI don't come here all that often but when I do, I invariably leave feeling satisfied and full.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2011-07-08", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "7R79mN6iJNU6o0CI1aBesA", "review_id": "CebC4g1BkzAh3lMM-AXSwg", "text": "So I have never been to P.F. Chang's before since I'm Chinese and I'm not a huge fan of eating at Chinese/American restaurants when I can eat delicious authentic Chinese food at home (courtesy of my momma). My boyfriend and I were at Dave & Busters and weren't in the mood for American food, which was what we were all surrounded by so I decided to give P.F. Chang's a try. \n\nWe came on a Saturday night without reservations, so we had to wait 45min :( Luckily time went by fast while I was on my phone looking at the Yelp reviews for this place. When we were seated, we ordered immediately and our server was very friendly. We got the salt and pepper calamari as an appetizer and then the Dan Dan noodles and Shanghai shrimp with garlic sauce. The food came out quick which was a huge plus considering how busy they were. The calamari was okay. I felt like the strips were cut too thin and we should have received more. The Dan Dan noodles were actually very delicious and flavorful. I really enjoyed them and definitely recommend them. The shrimp was cooked well and was also good. Overall I was happy with my first time experience here and would consider coming back if I'm ever in the mood for Chinese/American food.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2011-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2d5HeDvZTDUNVog_WuUpSg", "review_id": "oVFa1Ij2FWQ3KYgrR_w5wg", "text": "LOVE the food!!!!!! Try the bomb pop martini. The service has definitely Gone down hill in the past year. And when I've  told the manger he just doesn't give a shit.  It's either hit Or miss with service. But food is ALWAYS GOOD", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2011-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Oc3LydKbnaJjchuPZ6hQ1g", "review_id": "AnqCltsnCIuhZhj6ly9VzA", "text": "First time eating at PF Chang- thought the food was fine but I'd rather go to an authentic Chinese restaurant any day. It felt like a Chinese version of the Cheesecake factory.  \n\nAnyway, it was a Saturday, late afternoon, and despite lots of empty tables we had to wait 20 minutes to be seated and after that waited 30 min  for our food.  I don't know if they were just short staffed the day we went but I wasn't impressed with the service.\n\nSome nice items on the menu include the lettuce wraps and the salt and pepper calamari, which comes with a separate dish of salt and pepper for dipping. The sesame chicken was also very good.  Other things were fine, just not memorable.  \n\nI think this is an OK place to eat if you happen to be shopping at the Waterfront and don't mind spending a little time over lunch or dinner. If you want to get in and out in a hurry, don't come here.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2011-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_T7NY8DQ_36DmZ4uGoco8g", "review_id": "7WZU6jNOmmeuqwxUiPc_hA", "text": "This was my first time at this PF Chang's and I was not impressed. The service was extremely slow even though it was a Sunday night and the restaurant was not very busy. The portions were small. \n\nThey were also playing 5 year old pop music really loud. Pop music?! Come on--this is an \"Asian Bistro.\"", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2011-12-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "So32N7bSbUd1RwhFtI6jTQ", "review_id": "eeLNhxEHzvEA0JDTuQhJRA", "text": "I was unimpressed with my food and I am even more sad to see, now that P.F Chang's mass produces frozen dinners. \nThis is about as far away from Chinese food you can get, unless of course you are eating microwaved warmed shrimp fried rice. The restaurant is cluttered and the music was up so loud.  I had to yell to carry on a conversation. P.F Chang's in the Waterfront is a unmemorable experience. Maybe I would have better luck microwaving my own meal at home?", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2012-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "5kVILHxR7jRljKOfWyFO5w", "review_id": "8ryC4EiKGbmm4kjjo2fmIA", "text": "I really enjoyed my Mongolian beef and pork pot stickers, but \nThere was NO presentation of pfc mixing sauces. \nOne of the things that sets pfc apart from the run of the mill Non franchise is PRESENTATION and experience.  I was extremely disappointed by the LACK of presentation. \n\nReservations:\nOur party arrived about 15 minutes before our 5:30 reservations.\n\nAt 6:11 we were informed our reserved table had been given to another party . Obviously someone dropped the ball here.....\n\nWhen we requested silverware for the table. Our waitress blamed it on the hostess. Yes, theHostess should have provided silverware.. However It was unprofessional of our waitress to pass buck. As a Patron I could care less who's fault it is; just $@&&@in fix it. Defiantly took away from my pfc experience.\n\nMy Hot and sour soup is usally served with\"noodley\" things that I drop in the soup. We weren't given any \"noodley \" things . Not trying to be a jerk but all things being equal the pfc isn't selling food as much as they are selling an experience. This experience is what sets this restaurant apart.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 2, "date": "2012-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sApvvvnEp4Z-4do3a1pDgg", "review_id": "OyDJmdbURyrNAGtioyQzMA", "text": "I have mixed feelings about this place. I wish I could give 2.5 stars, but I'm in a good mood so I'm rounding up today. \n\nThis was my first time here and I honestly wasn't sure what to expect. The first thing I noticed when I walked in was the layout of the dining area. It seemed less intimate than I had pictured in my mind. The tables were all jammed together and the restaurant had a crowded feel to it. Fortunately, there wasn't a long wait as we had made a reservation. \n\nWe were seated at a table in the middle of the dining room alongside a busy throughway. It seemed all the servers were destined to walk past our table. I appreciated that their menu pointed out that their meals were \"meant to be shared.\" My wife and I decided to share our two meals: Chang's Spicy Chicken and Double Pan Fried Noodles. Before our meal came out our waitress set some sauces on the table in a \"here's your sauce\" kind of way. I remember thinking, \"That's very nice, but I have no idea why you just gave us sauce.\" There was no explanation - just a little tray of sauces. Our food came out and she finally asked if we like mild, medium, or hot sauce. We picked medium and, with a few scoops, she turned our three sauces into three mixed sauces and I still didn't know what they were for. \n\nForget the sauce though, my attention was now drawn to our meal. For meals that were \"meant to be shared\" these sure are little portions. I guess when you go for that high-end presentation you can charge 50% more for 50% less. The food itself was good (in an ok sort of way). I can't say it was the best I've had, but it was good enough. \n\nOverall I thought the experience was lacking. P.F. Chang's tries to be classy, but does it in a cafeteria sort of way. I was constantly distracted by the front doors opening and icy air pouring across the room. The music didn't fit the ambiance. Our table felt like it was in the middle of the road. The restaurant was loud and crowded. The girls at the table next to us were taking those annoying duck-face puckered lip pictures...  \n\nI think our experience may have been different if we were seated at one of the booths along the side of the restaurant, but no such luck.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2012-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gwnVSev8aNLvMArs3WTfFw", "review_id": "Kt5SJXY76Xph7kP-82lNDg", "text": "Surprised how empty the restaurant was tonight.   First time at this location.  Great service, but wasn't hard to do.....\n\nHad a combination Orange Shrimp and Chicken and Chicken Fried Rice.  It was typical PF Changs (Very good).  You can get the Fried Rice off the kids menu for $2.95 versus $8 for a big bowl off the regular menu.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2012-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Nf0SSRgStO8scYoPSNVqag", "review_id": "ptyWlOVzrOhbmECfmGs-pA", "text": "My daughter & I enjoy  PF Chang's each time we dine there together. I am in Love with the Chicken Lettuce Wraps delicious! It is always a wonderful experience!", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2012-03-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "sS2sSWqZMnQMRoWx-Mdzgg", "review_id": "HqfO-XN-C-3P0GkddKYkbA", "text": "I've always liked PF Chang's and, generally speaking, this location is pretty good. I typically opt to sit at the bar, where the service has always been extremely personable and fast.\n\nThe food is typical PF Chang's: delicious. As one of the chains that provides their nutritional information, it's also nice to know that I can go there and eat somewhat healthy (I'm all about the orange peel shrimp and steamed shrimp dumplings). While some complain about the portion sizes being too small, I've always felt like they were perfect. I do understand how someone looking at a $15 plate of \"Chinese\" food could wonder why he or she is paying more for less than your standard Chinese restaurant, but it's never bothered me. Most of the meals are consistently good, freshly prepared, and full of flavor. Plus, the sauce that your waiter/waitress makes for you is always a nice addition to any meal. I've tried most of the apps, soups, and quite a few of their entrées and have never been disappointed.\n\nI've only had one negative experience at this location in the countless times that I've gone, and it revolved around service in the main dining area. I was there for lunch, and the waitress essentially disappeared. I'm not sure if she had been fired, quit, or what, but she took the order and was never seen again. After sitting there for what seemed like an eternity with empty drinks, etc., I finally had to ask if someone else was going to be our server. I had never experienced something like that, but I received free food vouchers for a future visit, and luckily I wasn't in a rush that day, so it worked out. The experience would've made me give the location a worse rating, but one bad experience hasn't outweighed the countless positives: good meals, solid service (especially at the bar), and great takeout service for large orders and smaller ones.\n\nThe only other knock on this location - and it applies to every PF Chang's I've been to - is the insane wait that you'll encounter at dinner time. My wife and I would actually go there more often if we didn't have to wait forever for a table. I love PF Chang's, but I hate waiting more. If you live close enough, get curbside pick-up, or just find somewhere else. I've yet to meet a restaurant worth a 2-hour wait. PF Chang's, included.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2012-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k8sO7dCRGWcDWvKe0gm0mg", "review_id": "XKTJt6FYLUtiHdNXCn3KIA", "text": "used to wait hours for food here a few years ago\n\nsecond visit in 6 months -  kung pao shrimp was very salty\n\nvery good service\n\ngreat wall cake still very good - kids will not leave without having it", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2012-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "p9OvcIakpDoDXl0Lez5CJQ", "review_id": "nEJzsEjDpELEZVwZriCAfw", "text": "ok so i've eaten here more than once but just thought to write a review on it. now, i'll be honest this is the only one i've ever been to, so i don't know if they're all the same but every time i'm underwhelmed. i get there, look at their giant selection and get excited. then i get my meal and remember that i've never had anything too great. don't get me wrong, it's not bad, but for how much they charge, they really need to step it up or at least give me a huge portion. just saying...", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 2, "date": "2012-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "_vS9qNQvx8wVUOIkj4qfAg", "review_id": "-zhZiL403fFNS15yaBjlSA", "text": "Our last few visits have left something to desire, One of the things I always notice is the demeanor of an establishments employees. These people look miserable, no one smiles or greets you appropriately, it's more like get in, get out, turn the tables,\n\nThe food has remained consistently good... when we can order it. the last time JB and I came for a quick dinner, the place was not busy yet we were passed by 6 frowning waitstaff without getting drinks... for 15 minutes we were left suiting at our table with our menus closed and sitting on the edge of the table (HINT, HINT) so we left and most likely will not be returning.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 2, "date": "2012-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AWCIFNyGZ0CZO6-YMVnaKg", "review_id": "ixt2AlM2MAwHNINKsnYmdA", "text": "Me and wife really enjoy eating at this place. It's modern, tasty, and comfy. The only real complaint i have about this place is that the hostess or host whichever is working at the time seems like there doing you a favor by letting you eat at this establishment. The hot and sour soup is the best i have had in Pittsburgh, really good and filling!", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2012-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "1H6JRbIch54UDXwBDzNbUQ", "review_id": "bd1gxaunZg0PpD6FN6afcA", "text": "If you look at other reviews you will see that I am a very positive person, but tonight was an utter disaster!!  We sat at the bar and the female bartender  was miserable. We ordered drinks and she was unhappy that we did.  She spent 20 minutes sending text messages and took 3 smoke brakes in one hour while our drinks were empty. We ordered appetizers and they never came out.  She actually brought us our check and we never got our food. By the way we were the only people at the bar.  Finally a bus boy brought us our food after we payed. We payed before our food came because we thought our table was ready. We finally got seated by the windows. Do not sit by the windows because it was very cold. We ordered our dinner and drinks and guess what no drinks. After our food came we asked about our drinks and the waiter said he forgot. Nothing was comped and no manager was available. This PF Changs needs new management!! We will never return. I will give it 2 stars because the food was great, but the employees are absolutely miserably from hostess to waiters to bartenders. Steer clear until changes are made. It's not worth the headache.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 2, "date": "2012-11-25", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 0}, "user_id": "bSkco4ZdB7REFtDsJUVrDA", "review_id": "bkzrGc-LpY8qbB6mRjH-DQ", "text": "Came out here with my parents to have dinner.  I have to say that our meal was all around worth a 4 star rating, but the lousy attitude of the hostess and the man behind the desk who seemed to be in charge quickly lowered that rating.  \n\nOur food was pretty good.  The lettuce wraps are usually my favorite part, and this time it was no different.  My mom's fried fish peices and veggies was also delicious.  However, my $19 Mahi Mahi was pretty much like eating air... there was seriously no taste at all, and it was tiny!  I found myself adding all the extra sauces on the table just to try to give it some dang flavoring.\n\nIf I was you, I would order lettuce wraps for an app and lettuce wraps for your meal.  If you have room, lettuce wraps for dessert, too.  Oh yeah, and to drink, lettuce wraps.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2013-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "alYDpF9-YmFwkZjd4FOfkw", "review_id": "YdMmJnAyyHbhdokiR2SssQ", "text": "singapore street noodles.  The end", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2013-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BjO_lUbSavA3C5uyoau03Q", "review_id": "wx3NSVYrqKYVj9ej5wThtg", "text": "Rude unwelcoming short haired black hostess. Drinks were not good. Greasy spring  rolls \n\nBelow par on every way.  No experience needed to work here", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2013-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l5SH2Wkxl-g8wRSDrJnC2Q", "review_id": "EszDq6b-gSsvXvCrOvkBcw", "text": "Walked in tonight, Wednesday, at 9:50, the place was empty. Asked for a table, the hostess told us one moment when she finds one for us, then proceeded to walk to a dirty table and clean it!  The phone rang and she answered it as we stood at the door. When she hung up the phone she walked back to the table and proceeded to clean it again!!  Didn't say a word to us. Unbelievable!  Will not be back there-- rude hostess!", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2013-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-aNS-dqP6rPdKpG2swtwFQ", "review_id": "5kF5qc7CMr7i7rlpkEXuZA", "text": "The service started out slow, but they eventually picked up the pace. We ordered the chicken/lettuce wrap appetizer, and we enjoyed it. For the entres, we had the fried rice and mongolian beef, both of which were delightful. I would not mind going back to explore their menu.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2013-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ihsb0A8xtbGMrhUXVl-LgQ", "review_id": "Xm2oeJfB3bZdQ7_pwAHFKA", "text": "We recently went here for a group dinner with friends.  I am unable to eat gluten and my server (Denice) was knowledgable and brought me special sauces as not to irritate my allergies.  She was amazingly accommodating and when my meal was too spicy (which was totally my fault) she got me something else.  I had the GF beef with broccoli and it was amazing.  She was personable and friendly and went beyond expectations to make sure our table enjoyed themselves.  We were there for a while and were all on separate checks.  I've been to eateries before where that was treated with great disdain.  Never once did I feel unwelcome.  I will go out of my way to eat here again.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 5, "date": "2013-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k3kHdQ5VIGXVp7II44f2DA", "review_id": "n8g0lh-9IC3cb3KOjeWJzA", "text": "Great food, great atmosphere, little on the loud side but they have turned down the music since the last time we were here so it's much better, good service.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 5, "date": "2013-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a9jqs0dYDzqDZQPN5iRbKw", "review_id": "dkPAVu7B-2GWs66Ky6IyXQ", "text": "Good quality pork fried dumpling and mongo beef.  Bar service was fast and Efficent.   Good value.  Not a 5 cause dragon eye tea was cold first time around and beef had minor amount of fat.   Fortune was even Postive!", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2013-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pc2ezRRHcXUXWXmZutQPeg", "review_id": "mSNuQU1_xZcJAOiaq8HSzw", "text": "I usually have fair experiences with this PF Changs. I've been inside the restaurant, and have used the curbside to go service. I finally decided to review this based on my most recent experience.\n\nI can't remember her name, but whomever worked curbside to go on Oct 30, 2013 around 6:30PM deserves a mention. She was very nice, and provided us with the exact amount of condiments we listed on the online order form. They're usually stingy with the chili and hot mustard sauces! She also gave us a couple other sauces to try (not sure which ones), but these were very good. \n\nThe food here is always in point. I like to get the edamame, sesame chicken with brown rice, and the flour less chocolate dome! \n\nI'm reducing a star because of past experiences with service.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2013-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J_q8jN623uew8ZzMChXBCA", "review_id": "5WSmsDR2SdbC4LZEj2VgGQ", "text": "I've heard it's very much a chain and that it's not at all authentic Chinese food, however despite all that I have to admit the food was good and the service was excellent.  There is quite a disconnect with the loud Rock music played in the dining room and the serene Chinese decor, but I figure it works for somebody!  I ordered the Ginger Chicken with Broccoli and the meal was quite tasty.  The prices are quite reasonable.  Just as long as you are not looking for authentic Chinese dishes, this restaurant will definitely serve in a pinch.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2013-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8v2aMUZedyZU8cHCaHZBFw", "review_id": "-ly6dAQ7HZTe1Nc0o2HMoA", "text": "Really awesome food and amazing customer service. I really enjoyed my experience here if I am back in the area I will be certain to come back to this location.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2013-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ej3Oz4sJcIRKsjIe5FtC5A", "review_id": "qrwxkzJzvzRi4Pr1fbz8rQ", "text": "I seriously don't know why people love this place so much, the food here is horrible. The rice is never cooked properly.. And it's not even Asian food. It's fake asian food. I never come here anymore.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 2, "date": "2013-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6IUThQwDSUq2wx6KAu9PDw", "review_id": "1cVCgb97IGPgprDG7rATTA", "text": "I will say make a reservation since it's pretty busy on a weekend!  We got seated quickly with a reservation.  Our server was excellent despite how busy it was.  He was also helpful with recommendations and let me sample a couple wines before picking a bottle.  The manager was also great.  We weren't in love with one of the dishes and the manager came out and talked to us about what we were looking for and gave us a complimentary order of what he recommended.  I will say this - they know how to treat their customers. We'll definitely be back :)", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 5, "date": "2013-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nYKao-8w_IOj4Mv8QWb2vg", "review_id": "5_F-nzaDsWmr4BaMvD3msw", "text": "First, this is a big chain - not my favorite type of eatery.  For me, four stars is max for this type of establishment for the simple reason that no one has license to create anything truly unique...\n\nHowever!  The Chilean Sea Bass Marinated in Oolong Tea is freakin' fantastic!  10+\n\nNow - everyone was happy with their meals and let me tell you it was a ridiculously busy night, servers were threading their way through patrons waiting to be seated and our service was very good.\n\nI've been to PFC Vegas and PFC NYC - our Homestead PFC definitely beats them both.  So many great little places to try in the 'Burgh, but I wouldn't resist going back to this particular PFC.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2014-01-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BcTTdhB1HppPXbxu-RICeA", "review_id": "4Yc541zoQLFu2e47iaWvLQ", "text": "The wait was a little long, but once we got seated the service was very good. There was always a cold beer in my hand and the food was to die for.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2014-01-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sApvvvnEp4Z-4do3a1pDgg", "review_id": "qE5bU_MZl_sK_Nwj0kDQzg", "text": "We had another opportunity to eat here today and the experience was much improved. There was no crowd to fight and we weren't seated near the door as we were last time. As I expected, getting a table near the edge of the restaurant provides for a much nicer dining experience. Our service was good and they accommodated our 1 year old nicely. I appreciate that they serve steamed veggies on the kids menu. \n\nI still left with the impression that the serving sizes were small in comparison to most other places, but we were satisfied and happy.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2014-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "c3P8lRnyv_beqsg_efD0ew", "review_id": "Cwj6PFFBNcj16mVP4NSIig", "text": "Went here for lunch yesterday with a friend and it was so yummy! Started out with chicken lettuce wraps and it was totally hitting the hungry spot! Lol. Tried chicken lettuce wrap at my places but this place is one of my fave. Their wonton shop is also full of chicken chunks and shrimps as well... which is different bc you don't normally get all that in a wonton soup bowl.  By the time we ate the lettuce wraps and our soups, we were almost full. LOVE the way their Mongolian beef is made here and my friend had the crispy honey shrimp and it was so yummy as well. Definitely will be back because this place is clean, service is quick, food is delicious, and the price isn't so bad either.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2014-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H3-pVvBr5HVwMssf3PojjQ", "review_id": "3bgeOv-y783x0c5zdnBZ_A", "text": "We went last night Saturday night to P.F.Chang located at the Kierlands in Scottsdale. Terrible Experience!!! after waiting over one hour to be seated, we ordered calamari for appetizer which came with a horrible strange salty sauce and salt and pepper mix on the side. then I ordered beef and broccoli and my husband ordered a vegetarian dish with peanut sauce . After a long wait my food came so salty that I could not even eat and as much as I hate to complain but I had to let the waiter know, so he went to get me one with less salt. My husband's dish was OK. then the second one was a bit less salty but the meat had a terrible liver kind of taste which totally turned my stomach. I feel the reason they added so much salt was to hide the bad tasting rotted meat. Very bad experience. Our waiter was kind and sympathetic. ruined my evening out :(", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2014-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ROX0FasafqFknZKaTwgf0Q", "review_id": "pd_8UmwCAvptIRFSw4aMsw", "text": "Let me start off by saying I have mostly simple tastes, and my favorite lunch spot for Chinese has been the New Dumpling House in Squirrel Hill. But since that restaurant is undergoing renovations, I was forced to try something new.\n\nSo... I thought I'd try the chain PF Chang's Chinese Restaurant at the Waterfront. Wow, what an unsatisfying mistake that turned out to be.\n\nI started with a cup of their Wonton soup. At $2.95 it wasn't too outrageous of a price, the broth had some flavor and there was much more in it than I was used to, including three giant basil (I think?) leafs that covered everything beneath. In the broth were chunks of chicken, two shrimp, some sliced water chestnuts and two \"pork\"-filled wontons. As I said, the broth had decent flavor, but the wontons were thick, doughy and under-cooked, and the chicken chunks were dry, which is amazing since they were drowned in broth! On a scale of bad to good, it was kind of meh.\n\nNext came my \"lunch-portion\" order of Chang's Kung Pao Chicken (the dinner portion is $5 more). \n\nAt the New Dumpling House, this dish is served with a delectable dark, rich, tangy sauce, which I was really hoping for... Not at PF Chang's. \n\nOn my plate I received about 8 quarter-size chunks of lightly breaded and browned chicken, 7 hot Chinese red chili peppers (mostly inedible unless they are diced into a sauce), a handful of blanched, unsalted peanuts, a few sliced scallions, and a bed of the most bland brown rice I have ever encountered. Uncle Ben would've been ashamed if that stuff came out of one of his boxes.\n\nGlaringly, there was NO SAUCE!. None at all.\n\nI've had Kung Pao Chicken in New York City, San Francisco, and even from a hole in the wall in Bethel Park, PA that was much, much better. Never have I had it served in such a bland, skimpy, and overpriced way! The \"lunch-portion\" cost was $9.95.\n\nAt The New Dumpling House, I could have a delicious lunch, with soup, entree and complimentary hot tea, and I could leave satisfied with just $8 out-of-pocket -- and that includes the tip.\n\nThe service was decent. However, lesson learned. One and done. Never going back to PF Changs.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2014-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k3kHdQ5VIGXVp7II44f2DA", "review_id": "YvsATVz1uIbeN1fXFJAdlQ", "text": "Still good food but I find that more times than not when we go we have to ask for clean dishes or silverware. I have found this whether we are at the Waterfront location or the Robinson location. Maybe they need a new contract with a new appliance company.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2014-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZsDq4iNKrIp8wvxg6nWlxA", "review_id": "_QNuQ-r7kphq6SZpSssjvw", "text": "This is the fourth Changs I've eat ate. It was pretty good. The food was kinda like it had been previously frozen. Had a strange texture. Some of the changs chicken pieces was stuck together and the breading on the sweet and sour chicken was mushy and falling off the chicken. Overall still pretty good. Would eat at this one again.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2014-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fA4AkR13IEJyBWkQbumVGA", "review_id": "n-ykBuFH32GKe851BgJLIA", "text": "My wife and I came here a few years ago and you couldn't get in the door because of the line. This was the hottest new place on the restaurant scene and everyone wanted to try it. Fast forward to present day and you'd never believe that was ever the case. Chang's is poorly set up as one large open room that's rather noisy. Food came out quickly but was not as good as the Chinese take out we get from sesame inn. Spicy chicken was neither spicy nor very flavorful and had a mass-produced feel to it. Took half home to eat the next day but ended up throwing it out a few days later. Normally one of the great thing about getting Chinese is looking forward to the leftovers the next day!   Another minus was noticing how dirty the floor was on the way back to the bathroom. I don't expect a place to be immaculate in the middle of dinner service but this looked like the mcdonalds on Smithfield downtown.\nThe one bright spot was our waitress was very good and kept our water glasses filled. We just came from kennywood so we went through quite a few fill ups during our time there. Short of this, I'd probably give Changs two stars. Probably last time I'll stop in here unless I can't get in to any restaurants in the area and need a place I know won't be too busy.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2014-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "0HwN0YYwOtYwERj-eVnq0w", "review_id": "hwfqShsusGrbKNltUGbKHg", "text": "Our family loves this restaurant.  My children and I suffer from food allergies.   I have Celiac's Disease and their gluten free selection for a Chinese restaurant is great.  My children are a completely different ball game.  They have a rare disease called Eosinophilic Esophagitus where food attacks their body.  They are very limited on their food selctions due to not being able to consume any food with gluten, soy, eggs, dairy, nuts, tree nuts, fish, shellfish, amd corn.  This restaurant takes special care of my kids by making sure they get chicken that has not gone through the egg wash.  The servers and managers are all trained in how to be careful.  Our favorite manager is Joe and favorite server is Kevin.  Call ahead if you have any questions and they will answer your questions.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 5, "date": "2014-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "KpOVBdN4qnEa5ghu_t7TYQ", "review_id": "NLXaKrYQYBzejEgO4N5wTA", "text": "This place hit the spot. \n\nStopped here before a movie and ate at the bar. We got just what we wanted: quick service and some good eats. \n\nI recommend the fried green beans with aioli  -- soooo good! Who knew I liked green beans?! And this trip I tried some sushi and got the spicy tuna roll. Although it was clearly not pieced together by an expert sushi chef, it was extremely fresh and delish (so who cares if it's not beautiful?!)", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 5, "date": "2014-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xZvvlymX6hw_H-0cSjlrkQ", "review_id": "rqLdOdVZh8ROUN2YONxRKQ", "text": "Excellent beef with pepper and onions. Waiter made a good wine choice. Fastest food delivery, less than 5 minutes, honest. Both meals less than $30, in and out in 45 minutes.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2014-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GFCiXyD2JvItg0uni0DU0g", "review_id": "xZGU8REgpBUhF0QmCsdDkA", "text": "They give you such a tiny portion and I got the sweet n sour chicken as lunch and I was still hungry plus my rice was cold would I come Back maybe not", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 2, "date": "2015-01-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2QjMuYy9nj-ScKstFW5Jnw", "review_id": "KsQaLL3Mlr0_eVV3lIzkmQ", "text": "The only thing this place has going for itself is the decor. The food is very Americanized and not true at all of what real Chinese good should look or taste like, and the host/hostess think their doing us a favor by seating us.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2015-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5YZpsDGkw3WAX1KDuaXLeA", "review_id": "cowlMBcZsziqZyhGWT0V4Q", "text": "Dumb, dumber and dumbest are running the hostess stand. They gave me 7 different estimates on the wait time, none of which was accurate. John Tapper is needed on this property.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2015-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZywzB8TftoRMnHx7udqLLA", "review_id": "2dzBS7DsKNWKgGn2K_jPmQ", "text": "Good food, good service, and always an enjoyable visit. They forgot to put in our appetizer order but threw it in for free to make it up to us. A good place to catch a meal if you're down around the waterfront.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 5, "date": "2015-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z2ZLBPq_Vkb0Yel8Um-tvw", "review_id": "8NvhPJE8TDHhhXxricgI5A", "text": "I went with my family late at night ,the food was not good at all , it looked like the left over , I hate it.\nThe service was not that professional!!!!!!", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2015-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4DrkZqFqLcyRcLWuQUXFeQ", "review_id": "bkiX6r_4EqJyQ2XZ3NRgqg", "text": "I used to work here!  Haha, many moons ago tho.  Usually you leave a restaurant job sick of the food and the people but even after I left I still love going in and talking to the staff and getting something to eat and drink and just hanging out.  \n\nI'm a Changs Chicken junkie and I can't stay away from it for too long.  The bartenders have always been some of the best I've ever seen no matter how many changes they've gone through and this is one of the few places where even years and years later the same people work and still love it!  Says a lot about the people.  \n\nChangs Chicken, Chicken Lettuce Wraps and Pork Won Tons though are the standard fare are always amazing.  Some other excellent dishes are Kung Pao Chicken, Shrimp Dumplings, Mongolian Beef and The Ahi Tuna.\n\nIt might be a chain restaurant but this one is one of the strongest links in the chain!", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 5, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r_96n9O0jNzbNCZDkSB0EQ", "review_id": "7zWbIXDMoGv5ZgKENg-GnA", "text": "This place has gone downhill and I don't expect that we will be going back. In fact, I don't expect it to be in business past Christmas. They raised their prices, changed the menu, and removed several of our favorite dishes from the menu. The veggie dumplings are gone, the jasmine iced tea is gone, and the mini-dessert are gone. The food is meh. My broccoli was mushy in the ginger chicken and the sauce was like candy because it was too sweet.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 2, "date": "2015-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jv4GoH7tRX1SJTJjD7-osw", "review_id": "UUoimy_66fMlH92RqVokoA", "text": "First of all, I LOVE pfchangs, but I  recently visited here and had really bad experience. The waitress hardly paid any attention to us. The hostess had to like help her. I even wanted to order a to-go...but I couldn't find her, so I just went up to the bar and ordered it.  I'm a server myself, so maybe I had high expectations. ..but I still tipped her like 12 on 30. I still love it though.  I'm not gonna be an asshole and say \"I'm never coming back\" bc I know i will, lol.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2015-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aDL8mVwpR6gmpWcfYx15FQ", "review_id": "TsHsyeWPKaqvoEG7Nweg8w", "text": "We hadn't been at PF Changs for awhile and now I remember why....\nThe service was terrible. The silverware was dirty. We waited almost 15 minutes for water glasses to be brought to the table. The waiter forget several things we asked for and above all, the food was tasteless and the portion sizes smaller than lunch sized portions. We were there before the dinner crowd started so the lack of service or food quality can't be blamed on a busy time. Don't think we will be going back there.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2015-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6MQjQ3jfCUUxItIvKadJsw", "review_id": "yCM90-CCSK4MtTXdS-EPaw", "text": "Thank you so very very very much to the management Hallie.  She literally helped me with immediately with an error that was on my gift card.  \n\nAlso Hallie visited our table during our meal to see if everything and everybody was okay.\n\n Also our server, Aaron, was really helpful and sweet.  I am a very very picky eater.  I don't like onions, garlic, peppers, mushrooms, broccoli, rice, etc.  Aaron was awesome in his help as I selected my food.   \n\nVery rarely do  I eat dessert.  I love their  pineapple coconut ice cream.  There banana sprung rolls are good, but the ice cream is to die for.  The two come together.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 5, "date": "2015-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OltbotTvVqaVHooXphbOrA", "review_id": "KSwpHzmUk-iFTYjSY3lXtA", "text": "Meal was about what I expected. Service was good, not exceptional but good. They are trying a new menu with tacos for breast cancer awareness.  A nice thought but they should stay in their wheelhouse which is Asian. Obviously stick with what you know...", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2015-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Huvk0OmuczMxWJihVCgdgg", "review_id": "Wg3BpXLlT6O0ar2HVcK6MA", "text": "I was a little peeved that the gluten free version of the Buddha Feast cost $10.50 when the regular version cost $9.50. So you're charging a dollar more to give me the gluten-free version of a veggie, tofu, and rice platter?? Regardless, it's worth it to get the gluten-free soy sauce (which I buy for myself and I know isn't THAT expensive). When my dish comes out, it's literally just steamed veggies and rice. No tofu, no seasoning or sauce. I ask why there's no tofu and the response is that the tofu has gluten in it. When I ask if there should be any sauce (aka flavor) to the dish I'm informed I could've ordered any other gluten-free dish's sauce to go along with it. Thanks for the info now...yes I'll take the GF beef broccoli sauce on the side. The sauce comes out and it's actually tasty so my food was finally interesting enough to eat, even though now I'm extra annoyed at paying $10.50 for steamed veggies and rice and why the menu made no mention that you wouldn't get flavor or tofu. \nTo top it all off based on how miserable I feel now, I'm pretty sure the beef broccoli sauce they brought out contained gluten anyway! So I paid more, got less, and still got gluten in my food!?!? \nNot a happy customer. Not going back. Not going to recommend it to anyone.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2015-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lARSkAyvPCBOl67dZKMYwQ", "review_id": "55g43oJpYKq2RbA7f0qQLw", "text": "Disappointing :( I expected more out of PF Chang's. All I can say is that there is better Chinese at a non chain place, and it is cheaper. Wouldn't go back. I you want Chinese go to How Lee, or China Palace.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 2, "date": "2015-12-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XTDSmxVm9foF-UuPNWanog", "review_id": "i3RvinFLgagoQF4g2FtnwA", "text": "Went there today to have my birthday lunch, it was about 1:45 so the place was not crowded AT ALL. Got seated not far from the hostess station and sat for close to 15 mins without anyone coming to the table, no water, nothing. The table next to us who got seated after us had a server and water by the time we left. Got up to leave and the hostess said \"is everything OK\" I said \"no, no one ever came over\"and we went to Bravo and had a great lunch! I like PF Chang's in general but if the 2 hostesses watched us sit there for 15 mins I have no idea why they didn't do something. I won't be going back here anytime soon.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2015-12-20", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 4}, "user_id": "qlcwfLpIG62p2VccbG-idQ", "review_id": "gqEhkoed1ljMNWIFZS57dw", "text": "If I had to pick my very favorite chain restaurant, it would be PF Chang's.  I'm aware that it's not authentic, but that doesn't mean it's not delicious.\n\nWe stopped by after some shopping in the area on a snowy Friday, and were able to get a table pretty quickly.  The hostess and server were both friendly.  My husband enjoyed a glass of sake, and I had a mai tai that turned out to be delicious.  We split an order of lettuce wraps as an appetizer; they don't custom-make your sauce any more which is disappointing, but they did happily provide us with chili paste and hot mustard to doctor it up ourselves.  His Chang's Spicy Chicken (extra spicy) turned out great, and provided the extra requested heat.  My Orange Peel Shrimp were as good as I'd remembered-- perhaps better because they have some fresh orange slices included as well.  We also ordered a Great Wall of  Chocolate.  If you like  chocolate cake at all, you'll love this one.\n\nPF Chang's consistently provides good Chinese in a trendy (but still casual) atmosphere at a decent price, and I'm always a fan.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2015-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qg5VYZ1XdbgnIO9jYuNZqw", "review_id": "lf1v3wDoSP3C8XgnjDBAkw", "text": "This is largely a review for Sean, a managing partner at this location. I had gone to this location while in town with my family for the holidays, looking for a non-cooking escape before getting inundated with guests. A few of us ordered the lunch special with soups, my mom had ordered the butternut squash ravioli, and we also got an order of street noodles and started with summer rolls. Everything was great (the street noodles in particular are fantastic), but the service was a bit of a disaster- dishes came out more than 10 minutes apart from each other, a huge mood killer with a big family meal; a few dishes came out dirty; soups didn't come out at all; and our waitress made up excuses and didn't apologize when she had in fact missed some of our orders. We were feeling really ignored and discouraged, until we let Sean know. He took great care of us and went way, way out of his way to make up the experience. I really can't thank Sean enough for making sure we left in a good mood after what could have been a very negative experience. Heaven knows that a positive tone is ESSENTIAL going into the holidays with family!", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 5, "date": "2015-12-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rgm87VkWhPpKV2E7Di69dw", "review_id": "DKH4LmaGAvoRU707a_-ppg", "text": "If I had to use one word to describe my experience : Depressing. And even that is being generous.\n      I came in with two of my friends for new years eve before continuing on to the remainder of the evening. We ordered drinks at the bar while we waited for our table. My friend and I ordered the Asian pear mojito, which was decent. My other guest ordered a jack and coke and was immediately depressed to discover that it was all jack Daniels and a splash of coke for color.\n   When we got to the table, we were hoping for a better experience. Little did we realize, we would suffocate while holding our breath. \n      We ordered the combination fried rice, described  containing egg, chicken, pork, shrimp, and beef. When it arrived to the table, the only egg that was present was the ones we were wearing on our faces.\n     We also ordered the honey chicken and the beef with broccoli and again hoped for better quality. There were no complaints with the chicken, the only star of this evening. \n      The beef was disappointing to say the very least. To start, the kitchen sent out Mongolian Beef, rather than the intended entree. When they refired the dish, and it was presented, it looked better than it actually was. Never in my life have I bit into a piece of beef and instantly fear cracking a tooth. The beef in the dish was tough, and crunched (again a new first for me). \n              It will most likely be a very long time before I return. My only regret is I cannot leave a 1/2 star rating.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2015-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "64GBbjUMe_n6Yhi7OH_H6Q", "review_id": "GtSRvsw1wEfCKv7MRV5Gbw", "text": "Food was good. Service was super fast. We had to wait about 20 minutes even at 8:30 a night. Super packed on the weekend. Drinks are on the higher range.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 4, "date": "2016-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rGuk1S7MIU8M9ZE2mulVsg", "review_id": "K8C3R4owI4jCu8QO6eSBqA", "text": "Let's put the food aside here for a moment.  Let's talk about customer service for a moment.  Earlier this week, I had the misfortune of dining at the Waterfront P.F. Changs.  It was bitter cold outside. Their food is usually good, so my husband and I ducked in to get a bite before we went to the movies.  We were seated and we quickly ordered because we wanted to make our show time.  I didn't notice it at first, but I soon realized that it was cold in the restaurant. I asked about the heat and I was told that there was no heat - that it had broken earlier that day.  I asked our server why they hadn't mentioned this when we came in.  Well, I already know the answer to that - we would have turned around a gone somewhere else.  Then the manager came over and apologized.  I mentioned to him that it might have been nice to be warned about the heat (as I sat there in my coat).  He seemed to agree with me, but still allowed at least another 20 people enter the restaurant without saying a word to them. Not one word. Oh, he did offer me some dessert. That's what they usually do when someone has f**ked up.  In this case it didn't matter.  I quickly ate and left to make my movie.  This is the second bad experience I've had at this particular location.  Last time I was there, the floor was pretty dirty which always makes me nervous.  What does the kitchen look like?  I'm not against P.F. Chang's because it is a chain I have gone to in other states and have always liked the food.  This location needs to get their act together.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2016-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oQ4I--7YSxs9anVBsMlKaw", "review_id": "lD7JXisOP-ACKzpeQrsvlw", "text": "My wife and I ate here on a Saturday night.  The place was packed and we waited for an hour for a table.  The staff was very friendly and attentive.  The food was above average oriental cuisine.  We enjoyed egg rolls (best part of the meal), orange peel beef, and sweet and sour chicken.  Good meal but pricey.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2016-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b0Xkxcgc949u8uGFaYuj9w", "review_id": "AYlmFM6QVAO5qaAPAhArtA", "text": "disappointed, service was ok, not what it used to be, food wasn't that great either, the cook used way to much pepper on the rice. Chicken was very tough. So then some college kids end up sitting behind us, and was acting like they where in a bar. We had our kids with us and I came close to saying something, but the manager should have seen that and took care of it, he was at there table twice.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 2, "date": "2016-02-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oUOqjXjQ9OYwlWPh-brLKg", "review_id": "SlHiJgp8Qxl4K20hduXNDw", "text": "My girlfriend and I just ate here this was my first time eating at PF Changs but I had heard very good things about this restaurant. Starting with the service the server did not ever tell me his name I am also a waitress so I expected good service to begin with he was very quiet and when we did receive our food he never came back to ask how it was he was not very attentive at all however we both work in the service industry so we decided to give the food a chance since that's what we had come here for. My girlfriend got an appetizer of the edamame and the fried green beans the edamame was very Bland and needed seasoning the green beans were not spectacular although she did say that she enjoyed the sauce. for entrees I had the sweet and sour chicken I have had sweet and sour chicken from several other Chinese restaurants including take out and I was very displeased with the sauce and the poportion I've had better for cheaper. My girlfriend had the chicken fried rice which was fine but it's also a very easy dish overall we rated this restaurant with one star because we did not even care to stay for dessert even though the desert did look appetizing. I am pretty disappointed in my first experience I don't think that I will return again but you never know", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2016-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bkx4LRec6x0TpGIF_SD_Cw", "review_id": "j7f8mgZ4S6Okki8MrSUbow", "text": "The margaritas had too much sweetness too them even though they were organic - agave, lime juice, and tequila.\n\nWe had the pan-fried pot stickers, but they were barely fried...I wanted a little more crunch to them.  However, the pork was pretty flavorful and I liked the sauce they were topped with.\n\nMy boyfriend ordered the Hot Fish, but it was way too salty.\n\nI had a spicy lamb dish with grape tomatoes and mint which was actually delicious.\n\nUnfortunately, the service was definitely \"meh\" and one of the food runners spilled sauce on my boyfriend's pants...not cool.  The waiter offered seltzer water to try to get the stain out, but took forever to bring it to us.\n\nI would give this place another chance, but will definitely ask for less or no salt, and hope for a better waiter next time.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 2, "date": "2016-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DJS0o7mFgw55SnA2JwNrbg", "review_id": "FP6RS0EEt7T2ryy_ovMA_g", "text": "I normally love this chain restaurant, but this wasn't a good experience.  We arrived on a Saturday afternoon and there were plenty of empty tables.   Our server was very perky and took our drink orders.   \n\nOne of the reasons we picked here is because they have a nice gluten free menu.  We ordered appetizers, soup and entrees.  Our soup arrived first which just irks me.   Appetizers first please!!!!!!     The wonton soup was good, a bit different than most since it contained several shrimp and water chestnuts. We then waited a long time for our dumplings.  They were presented by a kitchen staff and looked beautiful but they didn't bring plates and he dashed away before we could stop him.  Although our server had stopped by too many times before this, she was now nowhere in sight.  We just ate them off the serving plate. Good, not great.  Not really hot, especially after waiting all that time.  The server did come by at some point to apologize for the delay and explained that's why she brought soup first.\n\nThe manager and the server continued to keep dropping by to the point of annoyance.   We waited forever for our food which was crazy since there were few patrons.  \n\nOur entrees came, again with no plates. We caught him this time and he slowly brought back 3 plates.   The bottom one was dirty and nobody in sight again. I got up and went to a serving station where a different server was standing and asked for a clean plate. He reached under the counter, pulled out a plate and then picked a white cloth up off the counter, wiped the plate and gave it to me.  I stated I didn't want a plate he had just wiped with a cloth laying on the counter and he stated it was how they cleaned their plates.   WHAT????????\n\nI went back to the table and used a small bread plate for my meal.  I was truly disgusted.  The server stopped by and my husband started to tell her our situation but I stopped him since we had spent soooooooo much time talking with this server that I didn't want to prolong this anymore.  \n\nAs far as food goes, the gluten free Mongolian beef was good.  The lemon chicken was tough and too thick.  The fried rice had no eggs and wasn't hot.  Overall, not a great experience.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2016-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AOVh6nNcbuOFvqMHlFCR1A", "review_id": "lIHZSj_esK6MfLAdK5ntpA", "text": "Decent/friendly service.  Slow kitchen (on a slow night with less than 1/4 filled).  Uneven food preparation.\n\nWhile the food could be very good, the place has very uneven quality in every aspect of the restaurant.  We had a large dinner (over 5 people and over $250 in total bill), and here's our impression.\n\n1) Food - Appetizers were very good, Chicken Lettuce Wrap, great as usual.  Lobster/Shrimp Taco excellent.  Sushi was lackluster across the board, almost not worth ordering - you might get better ones off a buffet assembly line.  The soups were uneven - Wonton soup excellent.  Hot n Sour soup is dense and salty, and again, worse than a standard $5 Chinese restaurant buffet line.  Main Entree is uneven as well - not particularly flavorful.  The new entrees are hit and miss.  Lamb is good and tender, though tasted nothing like lamb (just beef-flavor, the sauce is very heavy).  But the Chilean Sea Bass (Hong Kong style), one of the most expensive item on the menu, is severely undercooked - we should have sent it back but did not (our fault).  This is how under-cooked it is - we tried to cut it with a knife, and cannot because the middle was NOT cooked.  And Sea Bass is so flaky and it's supposed to fall apart at the touch of a fork.\n\n2) Service - Server is friendly, and accommodating to different requests.  Fresh plates are brought during change of courses.  On the other hand, the restaurant, though encouraging \"family style\" serving, does not quite know how to serve food in family style.  There are extended wait time between appetizer, to soup, to sushi, to entrees.  Family style would require items to be brought up as each is ready, rather than having guests wait for extended time and then have everything arrive at the same time.  For a place that was less than 1/4 seated, there was far too much wait time (20 min) between appetizer and just soup, and again extended wait between sushi and hot entrees.  By the time the main courses arrived, it was almost anti-climatic and people were pretty much full/tired.  It was not clear whose job it was to clear off the \"empty\" plates when food is eaten, a number of times it was piled up on the corners of a small table - again, at far cheaper buffet lines, these plates would have been cleared much, much sooner.\n\nOver the last decade, our P.F. Chang experience have gone from excitement to just a periodic visit with out-of-town guests - and the uneven food and service experience is not likely to encourage many re-visits.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2016-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kRm_weZiIXfG3TRmCaRVuw", "review_id": "9Bzaiy-xhMVfKqcviH14qg", "text": "One of the more embarrassing chains around. Basically a culinary minstrel show. Make-believe \"Asian\" food served alongside alcohol to full the senses, which would be necessary to enjoy this place.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2016-05-22", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 3}, "user_id": "9HCfCmd0t5GErgm7He6AeQ", "review_id": "Ng7XPsSNOqWA-iAYIHeUJw", "text": "P.F. Chang's China Bistro is a chain that is located across the states. This particular restaurant was the first that opened in Pittsburgh. It is good to come for lunch since they offer a shared 4 course special for a party of two for around $42.00.\n\nYou start off with a cup of soup, It is usually egg drop but they did let us substitute won ton for no additional cost. You then get a choice of an appetizer. We chose two egg rolls which we could split. You get the entree of choice. I had sesame chicken and my girlfriend had crispy honey chicken that was lightly battered and came with rice sticks.\n\nI enjoyed the soup, egg rolls and my sesame chicken. It came with peppers and broccoli. It was very good. You can only order white or brown rice with this special. I would imagine fried rice comes for a slight uncharge. My friend liked her chicken but said that the rice sticks had no flavor to them. \n\nThe last course was a dessert that was fried banana with a scoop of ice cream and some fruit.It came with two forks so it was a bit difficult to split in half but we managed. We liked the banana but weren't too fond of the ice cream. All in all it was a good deal for lunch. They do offer lunch specials during the week for smaller portions as well as cheaper prices. \n\nThey have a full bar with TVs blaring. Located near Barnes and Noble at the Waterfront it wasn't too crowded so we were able unwind and enjoy a nice lunch at a decent price.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 3, "date": "2016-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Iq4beW4vsrvYk2lqKpimtQ", "review_id": "ZC4VjZ9gGysef1U404z8EA", "text": "Great food. I've come to love Pf Chang's when it comes to Chinese food. Never disappoints me. Always a 5/5.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 5, "date": "2016-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1AiNhkmAX6wOYL9ezmFnWw", "review_id": "0HrSkqAsBuXVvYpct8svJg", "text": "Dinner with Friends,\n\nThe PF Chang's experience has transformed into more of a drive though than quality food. Our meal service took over 2 hours and each couple had to return at least one item to kitchen (appetizer or main entree).  I've been to other franchise location which are spectacular this location \"not so much\".", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 2, "date": "2016-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g-ZuKi34UzqRpP0YAe5gRQ", "review_id": "g0EOEZGtKL-NQRkKhDdMsw", "text": "Normally I don't review chain restaurants, but all the negative reviews inspired me to speak up. The service was excellent, the food was exactly what you would expect and want, and the whole experience was great. \n\nI'd never been to a PF Chang's before, and based on all these reviews I almost didn't go this time. But it was awesome! No complaints at all.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 5, "date": "2016-07-15", "type": "review"}
